[
    {
        "id": 1,
        "title": "Zendrops.",
        "paragraph": "zendrops. is a personal project started in the summer of 2022. It is a zen game (hence its name) with the aim to draw colorful circles like water drops in a relaxing background music by clicking/touching the screen. A little beta was first brought to life in HTML/Javascript. The year after I reworked this little concept bringing it to the mobile world using React Native and expo, extra features were added, like drops customization, changing music etc. Download the mobile app now to relax! (Android only).",
        "year": "2022-2024",
        "link": "zendrops.netlify.app/",
        "image": "/zendrops/zendrops.webp",
        "videoPreview": "/zendrops/zendrops-preview.webm",
        "video": "/zendrops/zendrops.webm",
        "type": "Website",
        "images" : ["/zendrops/logo.webp", "/zendrops/gameplay.webp", "/zendrops/gameplay2.webp", "/zendrops/gameplay3.webp", "/zendrops/design_examples.webp"],
        "technos" : ["React", "Expo", "AffinityDesigner"],
        "url" : "/projects/zendrops"
    },
    {
        "id": 2,
        "title": "Colorimac",
        "paragraph": "Colorimac is a minimalist color palette generator using the p3 js library. It was built in one week during our first year Imac engineering course in collaboration with Océane Drapeau. Different bubbles entangle with each other to create new colors, environments and atmosphere. It is an experiment on how colors interact with each other in the space in movement. You can pan, move the camera around the bubbles and generate other palettes. Five templates are available to check out.",
        "year": "2025",
        "link": "colorimac.netlify.app/",
        "image": "/colorimac/colorimac-thumbnail.webp",
        "videoPreview": "/colorimac/colorimac-thumbnail.webp",
        "video": "/colorimac/colorimac-thumbnail.webp",
        "type": "Website",
        "images" : ["/colorimac/colorimac-thumbnail.webp", "/colorimac/colorimac-thumbnail.webp"],
        "technos" : ["Javascript", "P5"],
        "url" : "/projects/colorimac"
    },
    {
        "id": 3,
        "title": "Dorian Studio",
        "paragraph": "Dorian Studio is a website I developed for a client to showcase his drone activities. I brought his vision to life using React and Supabase, creating a dynamic and interactive experience tailored to his needs. Multiple pages were designed to present his services and highlight his projects, providing a clear and engaging way for visitors to explore his work. I focused on combining aesthetic design with functionality, ensuring smooth navigation and a responsive layout across devices. From project galleries to service descriptions, every element was crafted to reflect the client’s brand and professional identity. The end result is a modern, polished platform that effectively communicates the client’s expertise and creativity in the drone industry.",
        "year": "2025",
        "link": "dorianstudio.fr",
        "image": "/dorianstudio/dorianstudio-thumbnail.webp",
        "videoPreview": "/dorianstudio/dorianstudio-thumbnail.webp",
        "video": "/dorianstudio/dorianstudio-thumbnail.webp",
        "type": "Website",
        "images" : ["/dorianstudio/dorianstudio-thumbnail.webp", "/dorianstudio/dorianstudio-thumbnail.webp"],
        "technos" : ["React", "Supabase", "Figma"],
        "url" : "/projects/dorian-studio"
    },
    {
        "id": 4,
        "title": "The Hunt: Savage Within",
        "paragraph": "In 2020, I participated in the short film The hunt: savage within produced by a French director based in Hollywood. I created an a priori language for an alien in this same film which reached over 23 000 views on Youtube.",
        "year": "2020-2021",
        "link": "www.youtube.com/watch?v=VQx-YENQNOM",
        "image": "/the-hunt/the-hunt.webp",
        "videoPreview": "/the-hunt/the-hunt.webp",
        "video": "/the-hunt/the-hunt.webp",
        "type": "Short-film participation",
        "images" : ["/the-hunt/the-hunt.webp", "/the-hunt/the-hunt.webp"],
        "technos" : ["Latex", "Language"],
        "url" : "/projects/the-hunt-savage-within"
    },
    {
        "id": 5,
        "title": "Rythm Keys",
        "paragraph": "Rythm Keys is a minimalist web game (realised the typo years later). This project was created only by curiosity in one month during spring of 2022. Inspired by rhythm games, Rythm Keys’ concept is quite straight-forward. As soon as a letter comes into the bottom part you have to type the corresponding key. The difficulty increases each time you type a correct key! Will you manage to beat the 160 letters record without cheating? Every file has been created from scratch by myself.",
        "year": "2022",
        "link": "rythmkeys.netlify.app",
        "image": "/rythm-keys/rk-thumbnail.webp",
        "videoPreview": "/rythm-keys/rk-thumbnail.webp",
        "video": "/rythm-keys/rk-thumbnail.webp",
        "type": "Web game",
        "images" : ["/rythm-keys/rk-thumbnail.webp", "/rythm-keys/rk-thumbnail.webp"],
        "technos" : ["Javascript", "AffinityDesigner"],
        "url" : "/projects/rythm-keys"
    },
    {
        "id": 6,
        "title": "SPART-AC",
        "paragraph": "During my second-year internship of my B.Sc in Laval, I collaborated with a Ph.D. student on a React application for his thesis. I was responsible for the creation of the app from the front-end development to the scenario creation and graphic design. The application used the SPART technology created by the laboratory which is a new Augmented Reality technology. It allows the user to enhance plane surfaces via sound and the creation of applications for teaching purposes. This project received recognition with the 2nd prize in the Innovative Device category at the 2023 MMI Festival.",
        "year": "2023",
        "link": "https://spart-lium.univ-lemans.fr/spart-ac/",
        "image": "/spartac/spartac.webp",
        "videoPreview": "/spartac/spartac.webp",
        "video": "/spartac/spartac.webp",
        "type": "AR web application",
        "images" : ["/spartac/spartac.webp", "/spartac/spartac.webp"],
        "technos" : ["React", "AffinityDesigner"],
        "url" : "/projects/spart-ac"
    },
    {
        "id": 7,
        "title": "Know Your Atlas",
        "paragraph": "Know Your Atlas is a geography game in the style of Geoguessr developed by myself since September 2022. The goal is to guess the location where you are randomly put into as fast as possible according to the chosen difficulty. The project uses the MapBox Gl JS API to generate three dimensional maps. Contrary to Geoguessr it uses satellite imagery and is completely free! It has been awarded the prize of the best website of the Laval MMI department of 2024.",
        "year": "2022-2024",
        "link": "knowyouratlas.netlify.app",
        "image": "/knowyouratlas/knowyouratlas.webp",
        "videoPreview": "/knowyouratlas/knowyouratlas-preview.webm",
        "video": "/knowyouratlas/knowyouratlas-preview.webm",
        "type": "Web game",
        "images" : ["/knowyouratlas/knowyouratlas.webp", "/knowyouratlas/knowyouratlas.webp"],
        "technos" : ["Javascript", "Rive", "Mapbox"],
        "url" : "/projects/knowyouratlas"
    }
    ,
    {
        "id": 8,
        "title": "Karaokeys",
        "paragraph": "Karaokeys is a web site created during my first year of IMAC engineering school. It uses many APIs to retrieve the video of the music and the synchronized lyrics to sing along with it. Only 3 songs are available for now.",
        "year": "2024",
        "link": "github.com/Akiliyh/Karaokeys",
        "image": "/karaokeys/karaokeys-thumbnail.webp",
        "videoPreview": "/karaokeys/karaokeys-thumbnail.webp",
        "video": "/karaokeys/karaokeys-thumbnail.webp",
        "type": "Website",
        "images" : ["/karaokeys/karaokeys-thumbnail.webp", "/karaokeys/karaokeys-thumbnail.webp"],
        "technos" : ["Javascript"],
        "url" : "/projects/karaokeys"
    }
    ,
    {
        "id": 9,
        "title": "Tennisdle",
        "paragraph": "Tennisdle is a webgame about guessing the correct tennis player based on their attributes (ranking, nationality, age, handedness, etc.). Try to guess the mystery tennis player of the day! Each day, a new player is randomly selected from the top 100 rankings. With every incorrect guess, you will receive clues such as the player's nationality, ranking, or playing style to help you find the correct answer!",
        "year": "2025",
        "link": "tennisdle.netlify.app",
        "image": "/tennisdle/tennisdle-thumbnail.webp",
        "videoPreview": "/tennisdle/tennisdle-thumbnail.webp",
        "video": "/tennisdle/tennisdle-thumbnail.webp",
        "type": "Website",
        "images" : ["/tennisdle/tennisdle-thumbnail.webp", "/tennisdle/tennisdle-thumbnail.webp"],
        "technos" : ["React", "NodeJs"],
        "url" : "/projects/tennisdle"
    }
    ,
    {
        "id": 10,
        "title": "T language",
        "paragraph": "The T Language is a constructed language created in the summer of 2022 and still in development to this day. It aims to be an extremely simple language to learn in the manner of a new Esperanto. The language has a very small vocabulary with a set of about 200 words and an exceptionally small phonological inventory as well. Like Japanese and Toki pona, it forms new words by combining existing words. For example, a sheet of paper can be said 'Crat cerit' 'Writing surface/ Surface for pen'. In this way, many words can be said in different ways and much is left to the interpretation of the speaker.",
        "year": "2022-2025",
        "link": "thetlanguage.netlify.app/",
        "image": "/tlanguage/tlanguage-thumbnail.webp",
        "videoPreview": "/tlanguage/tlanguage-thumbnail.webp",
        "video": "/tlanguage/tlanguage-thumbnail.webp",
        "type": "Language",
        "images" : ["/tlanguage/tlanguage-thumbnail.webp", "/tlanguage/tlanguage-thumbnail.webp"],
        "technos" : ["Language"],
        "url" : "/projects/t-language"
    }
    ,
    {
        "id": 11,
        "title": "Phantom",
        "paragraph": "Phantom is a video game built during my first year of Imac engineering course in 2025 in collaboration with Paul Marchiset and Nina Goislot. It was created with OpenGL and C++. The player controls a little character that needs to pick all the items while managing to escape the ghosts and the sorcerer.",
        "year": "2025",
        "link": "github.com/NinaGoislot/Phantom",
        "image": "/phantom/phantom-thumbnail.webp",
        "videoPreview": "/phantom/phantom-thumbnail.webp",
        "video": "/phantom/phantom-thumbnail.webp",
        "type": "Language",
        "images" : ["/phantom/phantom-thumbnail.webp", "/phantom/phantom-thumbnail.webp"],
        "technos" : ["OpenGL", "CPP"],
        "url" : "/projects/phantom"
    }
    ,
    {
        "id": 12,
        "title": "Miloni",
        "paragraph": "In this business scenario during our engineering course we were supposed to revitalize the beautiful region of Corsica, France. How to do it? Why? Our goal as a fictitious regional agency was to revitalize and enhance the tourism of Corsica by bringing new people to new places. This, in the aim to spread tourism more homogeneously and to hear the local residents. With this campaign we wanted to vulgarize the local tails of the region while making tourists explore nature and do activities.",
        "year": "2025",
        "link": "",
        "image": "/miloni/miloni-thumbnail.webp",
        "videoPreview": "/miloni/miloni-thumbnail.webp",
        "video": "/miloni/miloni-thumbnail.webp",
        "type": "Business",
        "images" : ["/miloni/miloni-thumbnail.webp", "/miloni/miloni-thumbnail.webp"],
        "technos" : ["Figma"],
        "url" : "/projects/miloni"
    }
    ,
    {
        "id": 13,
        "title": "Virtusio",
        "paragraph": "Virtusio is a brand new innovative way of experiencing museums through VR and more precisely with Google cardboards. As our final student project, we intended, with my group, to capture 360 videos of Laval’s castle with captive commentary. All the interactive elements of the app have been brought to life using Unity, together with gamified components. The spectator can click on points of interest to know more about the place and change scenes to navigate inside the castle.",
        "year": "2023-2024",
        "link": "https://drive.google.com/file/d/1q2Cyj5VtBt0atIq3xpBgXPHlqahhBHhQ/view",
        "image": "/virtusio/virtusio-preview.webp",
        "videoPreview": "/virtusio/virtusio-preview.webm",
        "video": "/virtusio/virtusio-preview.webm",
        "type": "VR Application",
        "images" : ["/virtusio/virtusio-preview.webp", "/virtusio/virtusio-preview.webp"],
        "technos" : ["Unity", "Wordpress", "Cardboard", "Blender"],
        "url" : "/projects/virtusio"
    }
]